Revit 2027 API
IPerformanceAdviserRule.InitCheck Method
 Invoked by performance advisor once in the beginning of the check. If rule checks document as a whole, the check can be performed in this method.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
void InitCheck(
	Document document
)
Sub InitCheck (
	document As Document
)
void InitCheck(
	Document^ document
)
abstract InitCheck :
        document : Document -> unit
Parameters
document Document
 Document for which performance problems are being checked.
See Also
Reference
IPerformanceAdviserRule Interface
Autodesk.Revit.DB Namespace